       IDENTIFICATION DIVISION.
       PROGRAM-ID. PHYS.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PROBLEMS
               ASSIGN TO "PROBLEMS.DAT"
                   ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
        FD PROBLEMS.
        01 PROBLEM.
           02 VELOCITY-INITIAL PIC 9(4)V99.
           02 ACCELERATION PIC 9(4)V99.
           02 TOTAL-TIME PIC 9(4)V99.
       WORKING-STORAGE SECTION.
        01 INTERMEDIATE-VAL-ONE PIC 9(8)V99.
        01 INTERMEDIATE-VAL-TWO PIC 9(8)V99.
        01 RESULT.
           02 DISTANCE PIC 9(8)V99.
        01 END-FILE PIC X.
           88 EOF VALUE "T".
       PROCEDURE DIVISION.
       BEGIN.
           PERFORM PROGRAM-INIT.
           PERFORM PROCESS-LINE WITH TEST BEFORE UNTIL EOF
           PERFORM PROGRAM-FINAL.
           STOP RUN.
       PROGRAM-INIT.
           OPEN INPUT PROBLEMS.
       PROCESS-LINE.
           READ PROBLEMS INTO PROBLEM
               AT END MOVE "T" TO END-FILE.
           IF NOT EOF THEN
               PERFORM CALC-DISTANCE
               PERFORM PRINT-RESULTS
           END-IF.
       CALC-DISTANCE.
           COMPUTE INTERMEDIATE-VAL-ONE = VELOCITY-INITIAL * TOTAL-TIME.
           COMPUTE INTERMEDIATE-VAL-TWO = 0.5 * ACCELERATION *
               TOTAL-TIME * TOTAL-TIME.
           COMPUTE DISTANCE = INTERMEDIATE-VAL-ONE + 
               INTERMEDIATE-VAL-TWO.
       PRINT-RESULTS.
           DISPLAY RESULT.
       PROGRAM-FINAL.
           CLOSE PROBLEMS.
       END PROGRAM PHYS.
